{"cited_context_after":" Nor is it less certain that the two races, equally free, cannot live in the same government. Nature, habit, opinion has drawn indelible lines of distinction between them. It is still in our power to direct the process of emancipation and deportation peaceably and in such slow degree as that the evil will wear off insensibly, and their place be pari passu filled up by free white laborers. If on the contrary it is left to force itself on, human nature must shudder at the prospect held up. We should in vain look for an example in the Spanish deportation or deletion of the Moors. This precedent would fall far short of our case. I considered 4 of these bills, passed or reported, as forming a system by which every fibre would be eradicated of antient or future aristocracy; and a foundation laid for a government truly republican. The repeal of the laws of entail would prevent the accumulation and perpetuation of wealth in select families, and preserve the soil of the country from being daily","cited_context_before":" & general emancipation. It was thought better that this should be kept back, and attempted only by way of amendment whenever the bill should be brought on. The principles of the amendment however were agreed on, that is to say, the freedom of all born after a certain day, and deportation at a proper age. But it was found that the public mind would not yet bear the proposition, nor will it bear it even at this day. Yet the day is not distant when it must bear and adopt it, or worse will follow. ","cited_quote":"Nothing is more certainly written in the book of fate than that these people are to be free.","cited_url":"https:\/\/avalon.law.yale.edu\/19th_century\/jeffauto.asp","citing_context_after":"Thomas Jefferson, AutobiographyFounding Father of USA Learn More: In Defense of JeffersonWhy Start with Wikipedia?Postponing: Journalism & AcademiaAlthough I am interested in bringing contextual citations to Journalism and Academicia, I expect it will take time to:convince the editors to use CiteItget the tech people to incorporate CiteIt in their publishing softwareteach the journalists\/academics to create contextual citationsCiteIt's current stratgey is to convert Wikipedia to contextual citations as a showcase of what's possible.Sample Wikipedia ArticlesClick on an image below to view sample Wikipedia articles that feature contextual quotations.John F. KennedyRuth Bader GinsburgHillary ClintonDonald TrumpHamletPride and PrejudiceManned Orbital LaboratorySyphilisLearn MoreMore DemosCiteIt WordPress PluginInspired byRead my article about Ted Nelson, which inspired me to create CiteIt.HomeDemosTry CiteIt!CodeBlogVolunteerFAQAbout","citing_context_before":"It.net - Building trust in mediaHomeDemosTry CiteIt!BlogCodeAboutOpen main menu Home Demos Try CiteIt! Blog Code AboutBuilding trust in mediaCiteIt is developing new digital tools that help combat misinformation and selective quotations. These tools show the context surrounding the quoted media in order to build trust and understanding.(Watch our video to learn more)Did you know there is a Cherry-picked quote on the Jefferson Memorial? Click on text in blue box below to see the quote in context.","citing_quote":"Nothing is more certainly written in the book of fate than that these people are to be free.","citing_url":"https:\/\/tim.m4dev.com\/","hashkey":"Nothingismorecertainlywritteninthebookoffatethanthatthesepeoplearetobefree.|tim.m4dev.com|avalon.law.yale.edu\/19th_century\/jeffauto.asp","sha256":"01eb7c9cade9dac1b09719bb8d1261fafb19f3c081e30076ccc97dcad175a962"}