{"cited_context_after":"\n\nWell--\n\nWhen other corporations, via -- because of the very fact you just point out, have already been used and are being used by the government to express its views; and you say another corporation can't object to that.\n\n--Well, to the extent, Justice Kennedy, that you are talking about what goes on in the halls of Congress, of course corporations can lobby members of Congress in the same way that they could before this legislation.\n\nWhat this legislation is designed to do, because of its anticorruption interest, is to make sure that that lobbying is just persuasion and it's not coercion.\n\nBut in addition to that, of course corporations have many opportunities to speak outside the halls of Congress.\n\nOne of the amicus briefs objects to -- responds to Justice Kennedy's problem by saying that the problem is we have got to contribute to both parties, and a lot of them do, don't they?\n\nA lot of them do, which is a suggestion about how corporations engage the political process and how co","cited_context_before":"hat rationale, which is undoubtedly true in many contexts, simply is not the case with respect to this case.\n\nBut under your position, if corporations A, B, and C, are called to Washington every Monday morning by a high-ranking administrative official or a high-ranking member of the Congress with a committee chairmanship and told to tow the line and to tell their directors and their shareholders what the policy ought to be, some other corporation can't object to that during the election cycle.\n\n","cited_quote":"The government silences a corporate objector, and those corporations may have the most knowledge of this on the subject.\n\nCorporations have lots of knowledge about environment, transportation issues, and you are silencing them during the election.","cited_url":"https:\/\/apps.oyez.org\/player\/#\/roberts2\/oral_argument_audio\/22476","citing_context_after":"Though there may be something to Justice Kennedy's concern, I suspect the type of corporate \"knowlegede transfer\" that he describes is atypical: Rather than expressing their \"knowledge\" in a 90-minute documentary or even an informative 1-minute commercial, in actual practice, most big corporate donors instead pay a group of political operators to set up a \"front group\" to develop a provocative 1-minute ad on an unrelated wedge issue. Kennedy's preoccupation about \"knowlege\" is mostly hypothetical and could be protected by a exception for the actual transfer of the corporations' subject-matter expertise. New Submission | Examples | Text-Version | GitHub Download","citing_context_before":" Document class generates the transcript from a javascript API. In the future, it would be nice to embeded an audio player similar to the one used on the oyez site, which plays the audio when a transcript line is clicked on. This would require createing a data format which maps transcript text to it's corresponding time. In Citizens United vs FEC, Justice Anthony Kennedy expressed his concern that the valuable knowledge of corporations would be suppressed by a ban on corporate campagin funding. ","citing_quote":"The government silences a corporate objector, and those corporations may have the most knowledge of this on the subject. Corporations have lots of knowledge about environment, transportation issues, and you are silencing them during the election. ","citing_url":"https:\/\/www.openpolitics.com\/citeit-sample-code-master\/examples.html","hashkey":"Thegovernmentsilencesacorporateobjector,andthosecorporationsmayhavethemostknowledgeofthisonthesubject.Corporationshavelotsofknowledgeaboutenvironment,transportationissues,andyouaresilencingthemduringtheelection.|www.openpolitics.com\/citeit-sample-code-master\/examples.html|apps.oyez.org\/player\/#\/roberts2\/oral_argument_audio\/22476","sha256":"03162cf9138560b30532e6cfe61e5978de1c21da4ad6c35eefec71f5c4240e3b"}