{"cited_context_after":"\" \"Pride,\" observed Mary, who piqued herself upon the solidity of her reflections, \"is a very common failing, I believe. By all that I have ever read, I am convinced that it is very common indeed, that human nature is particularly prone to it, and that there are very few of us who do not cherish a feeling of ​self-complacency on the score of some quality or other, real or imaginary. Vanity and pride are different things, though the words are often used synonimously. A person may be proud without being vain. Pride relates more to our opinion of ourselves, vanity to what we would have others think of us.\" \"If I were as rich as Mr. Darcy,\" cried a young Lucas, who came with his sisters, \"I should not care how proud I was. I would keep a pack of foxhounds, and drink a bottle of wine a day.\" \"Then you would drink a great deal more than you ought,\" said Mrs. Bennet; \"and if I were to see you at it, I should take away your bottle directly.\" The boy protested that she should not; she continued","cited_context_before":"a.\" \"Another time, Lizzy,\" said her mother, \"I would not dance with him, if I were you.\" \"I believe, ma'am, I may safely promise you never to dance with him.\" \"His pride,\" said Miss Lucas, \"does not offend me so much as pride often does, because there is an excuse for it. One cannot wonder that so very fine a young man, with family, fortune, everything in his favour, should think highly of himself. If I may so express it, he has a right to be proud.\" \"That is very true,\" replied Elizabeth, \"and ","cited_quote":"I could easily forgive his pride, if he had not mortified mine.","cited_url":"https:\/\/en.wikisource.org\/wiki\/Pride_and_Prejudice\/Chapter_5","citing_context_after":" 2: Tyler Cowen interviews David Wolpe In a medium.com article, Tyler Cowen commented to David Wolpe about how social media strips away context: I think that Judaism has the same problem that any thick civilization has in a world in which, as you say, context is stripped away. And not only is context stripped away, but attention to any one thing is canter and less than it used to be. So, for example, a lot of Jewish commentary is based on your recognizing the reference that I make. Who recognizes references anymore? Because people don't spend years studying books. You can mark up the quote with html tags such as , ,  or any other tag that will not change the text version of the quote when the hmtl is converted to text. 3: YouTube Video: Malcolm Gladwell: Crime Show Taxonomy When you cite a YouTube video, in addition to looking up the 500 characters of transcript context, CiteIt's WordPress Plugin embeds a hidden iframe, starting at the video's start time if you include the time offset ","citing_context_before":"CiteIt.net a higher standard of citation How to generate the citation context for this example: Upload this file to a public website Submit this page's URL using the Submission Page This will generate JSON files for each quote. You can view the JSON files for this page in your browser's developer mode. Examples 1: Pride & Prejudice CiteIt.net allows inline popup quotations use the  tag: In Chapter 5 of Pride and Prejudice, Elizabeth confesses how Darcy offended her, saying: ","citing_quote":"I could easily forgive his pride, if he had not mortified mine.","citing_url":"https:\/\/www.openpolitics.com\/citeit-sample-code-master\/examples.html","hashkey":"Icouldeasilyforgivehispride,ifhehadnotmortifiedmine.|www.openpolitics.com\/citeit-sample-code-master\/examples.html|en.wikisource.org\/wiki\/Pride_and_Prejudice\/Chapter_5","sha256":"1d1ddf258de9f327dc8fc32aa32ee2f21a14d3548b4075432d17866837034265"}