{"cited_context_after":"monses Edwin was being told to write could change. One week, they might want turnstile jumpers, another week they'd want open containers. And they'd tell him, the reason we're having you do this is because when you summons people, it's an opportunity to check if they have a warrant. And if they do, you can arrest them, because it means they've committed a serious crime. It made sense to him. EDWIN: You see, at first I felt good because when someone would have a warrant it felt good. It was like, okay he had a warrant. Until one day, it was just, this- the–girl looked like she was 10. And she wasn't my arrest. I arrested someone else with something but she was in the cells. And I said, \"Young girl, like, what are you doing here?\"She's like, \"Oh, like, um, me and my friends, we went through the turnstile together.\" I said, \"Where's your friend?\" \"Oh, my friend, she got a summons and they arrested me.\" I said, \"For what–how old are you?\" \"16.\" I said, \"But for what? Just going through the","cited_context_before":" you had to–you have overtime but you gotta come back with five summons?PEDRO: Five summonses or get dealt with. I'll explain that later. Well, we, uh, we're driving around and the senior guy stops and says, \"All right. This is one.\"PJ: It's really early in the morning. The streets are almost completely empty. It's hard to even find a person, let alone somebody doing something wrong. Their boss is pointing at this man who's just standing on the sidewalk alone, outside a store. But the van stops.","cited_quote":"PEDRO: Some guy jumps out. And this one guy, in front of a bodega, doing absolutely nothing, they gave him a summons for blocking pedestrian traffic. You know, we were just shaking our heads like, \"What did you give him?\" \"Blocking pedestrian traffic.\" And they just start laughing. I'm like, oh wow. All right. So we move on.PJ: Pedro says the next stop was this Mexican man who was just sitting alone on a stoop. They wrote him up for the exact same thing: Blocking pedestrian traffic.PEDRO: And this was all night until all of us–there was like a four or five of us in the van, until everyone had five. PJ: Pedro was so confused by what had had happened that night, he actually went home, and looked up the definition of blocking pedestrian traffic. These guys had not been blocking pedestrian traffic. This was absurd. And Pedro didn't know it, but all over the city cops were getting pushed in the exact same way -- to aggressively write summonses to people for doing seemingly nothing. I talked to another cop, this guy in Brooklyn named Edwin Raymond.EDWIN RAYMOND: After the academy, I would run into officers that I was in the academy with. And it'd be like, \"Oh, hey, what's up? Are you still at transit?\" And the third question, without fail, the third question was always, \"What do they want from you guys over there?\" That's how much this is part of the culture. PJ: Week to week, the sum","cited_url":"https:\/\/gimletmedia.com\/shows\/reply-all\/o2hx34\/127-the-crime-machine-part-i","citing_context_after":"rime Machine, Part I (In the future I would like this embeded audio player to be generated automatically from the citation (just like the YouTube example) and start from a timestamp, which in this case is 2:37) This quote is from the beginning of Reply-All's superb two-part series called: The Crime Machine Part 1 Part 2. This example is useful because the html code has been supplemented with meta-data:  5: Quoting the Supreme Court: Javascript API Here's an example of a site that is not a normal html site, but rather the page the reader visits is generated from javascript. A site-specific adaptor for the Document class generates the transcript from a javascript API. In the future, it would be nice to embeded an audio player similar to the one used on the oyez site, which plays the audio when a transcript line is clicked on. This would require createing a data format which maps transcript text to it's corresponding time. In Citizens United vs FEC, Justice Anthony Kennedy expressed his c","citing_context_before":"-Tracking System Reply-All did a story in 2018 about how the New York City's CompStat Crime-Tracking System was developed and how the Police Department changed with the introduction and use of the computer system. The result was that police officers are given quotas for the number of summons (tickets) they need to issue, forcing them to trump up the charges if necessary. It's a story that illustrates the perils of broken-glass policing and how policing evolved in New York City and other cities: ","citing_quote":"PEDRO: Some guy jumps out. And this one guy, in front of a bodega, doing absolutely nothing, they gave him a summons for blocking pedestrian traffic. You know, we were just shaking our heads like, \"What did you give him?\" \"Blocking pedestrian traffic.\" And they just start laughing. I'm like, oh wow. All right. So we move on. PJ: Pedro says the next stop was this Mexican man who was just sitting alone on a stoop. They wrote him up for the exact same thing: Blocking pedestrian traffic. PEDRO: And this was all night until all of us–there was like a four or five of us in the van, until everyone had five. PJ: Pedro was so confused by what had had happened that night, he actually went home, and looked up the definition of blocking pedestrian traffic. These guys had not been blocking pedestrian traffic. This was absurd. And Pedro didn't know it, but all over the city cops were getting pushed in the exact same way -- to aggressively write summonses to people for doing seemingly nothing. I talked to another cop, this guy in Brooklyn named Edwin Raymond. EDWIN RAYMOND: After the academy, I would run into officers that I was in the academy with. And it'd be like, \"Oh, hey, what's up? Are you still at transit?\" And the third question, without fail, the third question was always, \"What do they want from you guys over there?\" That's how much this is part of the culture. Reply All · #127 The C","citing_url":"https:\/\/www.openpolitics.com\/citeit-sample-code-master\/examples.html","hashkey":"PEDRO:Someguyjumpsout.Andthisoneguy,infrontofabodega,doingabsolutelynothing,theygavehimasummonsforblockingpedestriantraffic.Youknow,wewerejustshakingourheadslike,â\u0080\u009cWhatdidyougivehim?â\u0080\u009dâ\u0080\u009cBlockingpedestriantraffic.â\u0080\u009dAndtheyjuststartlaughing.Imlike,ohwow.Allright.Sowemoveon.PJ:PedrosaysthenextstopwasthisMexicanmanwhowasjustsittingaloneonastoop.Theywrotehimupfortheexactsamething:Blockingpedestriantraffic.PEDRO:Andthiswasallnightuntilallofusâ\u0080\u0093therewaslikeafourorfiveofusinthevan,untileveryonehadfive.PJ:Pedrowassoconfusedbywhathadhadhappenedthatnight,heactuallywenthome,andlookedupthedefinitionofblockingpedestriantraffic.Theseguyshadnotbeenblockingpedestriantraffic.Thiswasabsurd.AndPedrodidntknowit,butalloverthecitycopsweregettingpushedintheexactsameway--toaggressivelywritesummonsestopeoplefordoingseeminglynothing.Italkedtoanothercop,thisguyinBrooklynnamedEdwinRaymond.EDWINRAYMOND:Aftertheacademy,IwouldrunintoofficersthatIwasintheacademywith.Anditâ\u0080\u0099dbelike,â\u0080\u009cOh,hey,whatsup?Areyoustillattransit?â\u0080\u009dAndthethirdquestion,withoutfail,thethirdquestionwasalways,â\u0080\u009cWhatdotheywantfromyouguysoverthere?â\u0080\u009dThatâ\u0080\u0099showmuchthisispartoftheculture.|www.openpolitics.com\/citeit-sample-code-master\/examples.html|gimletmedia.com\/shows\/reply-all\/o2hx34\/127-the-crime-machine-part-i","sha256":"3c67fb8915d9b56146037a2f023cdea83646245ed8194f1f27fc590ad12ea6e5"}