{"cited_context_after":"e optimistic take on that is that the availability with ease of the vast libraries of Jewish learning at your fingertips will create a more conversant community. And in some ways I think that has happened. The negative is that Jewish culture will get thinner and thinner, and Judaism, as you said, depends on a very deep and thick culture.COWEN: If I look at the history of the arts in other areas, I see a tendency for centralization of the past. So I think today, actually, many more people read Shakespeare than they did 30 years ago. But older plays and fiction are in general less read. More people read Jane Austen, but the second-tier authors from that time are less read. Maybe from the 1960s it will be the Beatles, but the Byrds will fall away. Whatever. Do you see that happening with Jewish philosophy and with the Hebrew Bible? There's a centralization of what people know and a falling away of what superficially appears to be less important.WOLPE: I think what you're describing is som","cited_context_before":"ite for mainstream media will tell you this: \"Well, I wrote an article that ended up on Facebook in a very different setting than how I intended it to be read.\" And you can say all you want — all the hyperlinks are there, but people don't click through.What do you think is the intellectual future of a belief system based on commentary on commentary on commentary, now injected into a world with this technology that so strips away context and just gives you some bald statement of something?WOLPE: ","cited_quote":"I think that Judaism has the same problem that any thick civilization has in a world in which, as you say, context is stripped away. And not only is context stripped away, but attention to any one thing is scanter and less than it used to be.So, for example, a lot of Jewish commentary is based on your recognizing the reference that I make. Who recognizes references anymore? Because people don't spend years studying books. Th","cited_url":"https:\/\/medium.com\/conversations-with-tyler\/rabbi-david-wolpe-leaders-religion-israel-identity-7c159c2ed2d","citing_context_after":"iled Under: Uncategorized Leave a Reply Cancel replyYour email address will not be published. Required fields are marked *Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Sample Code Index an Page: Submit a URL Example Code: html template Text Version of HTML page & YouTube transcripts Download sample code Recent Posts This Is Water: David Foster Wallace Constitution: 4th Amendment Transcript Bug: Timing Quote Requiring Brackets Danielle DiMartino Booth of Quill Intelligence Recent Comments Archives July 2020 June 2020 May 2020 March 2020 February 2020 January 2020 December 2019 November 2019 June 2018 December 2017 September 2017 May 2017 April 2017 March 2017 February 2017 January 2017 October 2016 Categories alt-language bible emojis pdf q-tag transcript Uncategorized unicode video vimeo youtube Meta Log in Entries feed Comments feed WordPress.org CiteIt.net: created by Tim Langeman CiteIt.net is a web authoring tool that e","citing_context_before":"▲CiteIt.net▼a higher standard of citationHome WordPress Plugin Demo Code Volunteer Blog About When context is stripped away .. July 12, 2020 by test Leave a Comment ","citing_quote":"I think that Judaism has the same problem that any thick civilization has in a world in which, as you say, context is stripped away. And not only is context stripped away, but attention to any one thing is scanter and less than it used to be. So, for example, a lot of Jewish commentary is based on your recognizing the reference that I make. Who recognizes references anymore? Because people don't spend years studying books. F","citing_url":"https:\/\/demo.citeit.net\/2020\/07\/12\/when-context-is-stripped-away\/","hashkey":"IthinkthatJudaismhasthesameproblemthatanythickcivilizationhasinaworldinwhich,asyousay,contextisstrippedaway.Andnotonlyiscontextstrippedaway,butattentiontoanyonethingisscanterandlessthanitusedtobe.So,forexample,alotofJewishcommentaryisbasedonyourrecognizingthereferencethatImake.Whorecognizesreferencesanymore?Becausepeopledontspendyearsstudyingbooks.|demo.citeit.net\/2020\/07\/12\/when-context-is-stripped-away|medium.com\/conversations-with-tyler\/rabbi-david-wolpe-leaders-religion-israel-identity-7c159c2ed2d","sha256":"4eff2a7b9073cedacd02e8889141b9971f0561309c1ddf02cf72684694faf790"}