{"cited_context_after":"I think workers and Americans understand the concept that you shouldn't be paid more to stay home than to work,\" he said.CLICK HERE FOR THE FOX NEWS APPMnuchin said that the Trump administration and Senate Republicans are on the same page with a $1 trillion package, but noted that in the interest of passing a bill quickly, issues that are more difficult to negotiate with Democrats could be held off for another bill.\"This will be the fifth set of legislation, so there's no reason why we can't have number five, six, and seven as we need to deal with issues, and obviously anything we do, we need bipartisan support,\" he said. Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox Arrives Weekdays Subscribe Subscribed Subscribe You've successfully subscribed to this newsletter! 2020 Presidential ElectionBiden campaign declines 'Fox News Sunday' interview, 1 week after Chris Wallace's Trump sitdownAndrew McCarthy: Trump won'","cited_context_before":"effectively giving everybody a tax cut, and is much quicker than the payroll tax cut,\" he said.STIMULUS CHECKS, STATE AID AND MORE: WHAT'S IN HOUSE DEMOCRATS' NEW CORONAVIRUS RELIEF BILLMeanwhile, key parts of the CARES Act are set to expire in the near future. The Paycheck Protection Program that provides small businesses with forgivable loans, is set to end in early August, and the enhanced unemployment insurance benefits will expire on July 31. A federal eviction ban already ended on July 25.","cited_quote":"Mnuchin said that the new bill will provide additional unemployment benefits, but noted that it will be less than the payments issued under the CARES Act, because some workers were collecting more than they earned on the job. As a result, when businesses were reopening some employees did not have an incentive to return to work.Mnuchin said that upcoming unemployment benefits would be in the form of 70 percent wage replacement.\"","cited_url":"https:\/\/www.foxnews.com\/politics\/mnuchin-coronavirus-second-stimulus-bill","citing_context_after":" Filed Under: Uncategorized Leave a Reply Cancel replyYour email address will not be published. Required fields are marked *Comment Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Sample Code Index an Page: Submit a URL Example Code: html template Text Version of HTML page & YouTube transcripts Download sample code Recent Posts Mnuchin optimistic as GOP set to introduce Senate coronavirus stimulus bill Monday Mnuchin says GOP coronavirus relief package will be released Monday This Is Water: David Foster Wallace Constitution: 4th Amendment Transcript Bug: Timing Recent Comments Archives July 2020 June 2020 May 2020 March 2020 February 2020 January 2020 December 2019 November 2019 June 2018 December 2017 September 2017 May 2017 April 2017 March 2017 February 2017 January 2017 October 2016 Categories alt-language bible emojis pdf q-tag transcript Uncategorized unicode video vimeo youtube Meta Log in Entries feed Comments feed WordPress.","citing_context_before":"▲CiteIt.net▼a higher standard of citationHome WordPress Plugin Demo Code Volunteer Blog About Mnuchin optimistic as GOP set to introduce Senate coronavirus stimulus bill Monday July 26, 2020 by timlangeman Leave a Comment ","citing_quote":"Mnuchin said that the new bill will provide additional unemployment benefits, but noted that it will be less than the payments issued under the CARES Act, because some workers were collecting more than they earned on the job. As a result, when businesses were reopening some employees did not have an incentive to return to work. Mnuchin said that upcoming unemployment benefits would be in the form of 70 percent wage replacement.","citing_url":"https:\/\/demo.citeit.net\/2020\/07\/26\/mnuchin-optimistic-as-gop-set-to-introduce-senate-coronavirus-stimulus-bill-monday\/","hashkey":"Mnuchinsaidthatthenewbillwillprovideadditionalunemploymentbenefits,butnotedthatitwillbelessthanthepaymentsissuedundertheCARESAct,becausesomeworkerswerecollectingmorethantheyearnedonthejob.Asaresult,whenbusinesseswerereopeningsomeemployeesdidnothaveanincentivetoreturntowork.Mnuchinsaidthatupcomingunemploymentbenefitswouldbeintheformof70percentwagereplacement.|demo.citeit.net\/2020\/07\/26\/mnuchin-optimistic-as-gop-set-to-introduce-senate-coronavirus-stimulus-bill-monday|www.foxnews.com\/politics\/mnuchin-coronavirus-second-stimulus-bill","sha256":"5696ddf768115df9724e2278b56b7a61413ab40089e519814e98aec2ac0a7199"}