{"cited_context_after":"","cited_context_before":"","cited_quote":"the data indicates that the President remains healthy.","cited_url":"https:\/\/media.arkansasonline.com\/news\/documents\/2020\/06\/03\/Trump_Physical_Exam.pdf","citing_context_after":"\" HTML: memorandum saying \"the data indicates that the President remains healthy. #0099ff Match citeit-footnote-shortname Footnote is a short form of citation. The program needs to Need to cross-reference the short name with the longer reference in the references cited section. The footnote is listed in the short form: Lastname, page Example: Troy 2006, pp. 176–77 References cited: Troy, Gil (2006). Hillary Rodham Clinton: Polarizing First Lady. Lawrence, Kansas: University Press of Kansas. ISBN 978-0-7006-1488-2. red Wiki citeit-footnote-later The match is not found in the first footnote, but in a second footnote. Quote: \"In July 2016, she \"committed\" to introducing a U.S. constitutional amendment\" 1st Source: not found 1st Source URL: http:\/\/www.cnn.com\/2016\/07\/16\/politics\/hillary-clinton-campaign-finance\/2nd Footnote 1: Merica, Dan (July 16, 2016). \"Clinton: I will introduce campaign finance amendment in first 30 days\". also see 2 1\/2-minute video: CNN. Retrieved July 17, 2016. Foot","citing_context_before":"turned: Clinton called Mr. Trump's 2018 budget proposal \" a cong \" which she said would underfund public education red Error citeit-error-quote-context-edges Slight character errors in Surrounding Context Example: \"adding that her mother Dorothy \"made sure I learned [these] words from our Methodist faith\" Quote: \"And she made sure I learned [these] ds from our Methodist faith\" red PDF citeit-pdf-scanned Source Document is a PDF image that needs to be scanned with OCR Example: memorandum saying \"","citing_quote":"the data indicates that the President remains healthy.","citing_url":"https:\/\/pages.citeit.net\/2020\/10\/24\/wikipedia-project\/","hashkey":"thedataindicatesthatthePresidentremainshealthy.|pages.citeit.net\/2020\/10\/24\/wikipedia-project|media.arkansasonline.com\/news\/documents\/2020\/06\/03\/Trump_Physical_Exam.pdf","sha256":"741e6229c26a378103991d32b454d379a0d99c5960a183cfb3c77e20f2b88f57"}