{"cited_context_after":" in every John Grisham novel the same they all precede I love John Grisham to speak Lear but they all perceive from the same premise which is the system is rotten to the core and only this white knight who comes in from the outside can save us so in the Western there is no system in the northern there's a system it's fantastic in in the eastern the system is reformed from within but in the southern the system has to be reformed from without huh that's my complicated so I feel like anything you can place all art about law and order about the criminal world criminal justice into one of these four categories and the so the Brits love the northern so what is you know all of the the famous British detective stories or always Robocop's Sherlock Holmes yeah is it northern it's like the system is like and the you know that there's no corruption on the police department they may be bumbling and Charles gotta help them out but no-one's you know off on some there's no there's never a case where t","cited_context_before":"now that the bad guys gonna get caught and the good guy I don't know this is a random thought but I don't know any men who watch them and I've come to the belief that they are there's something there actually for women and there are a very comforting kind of reassuring fantasy about how the world works that that you know there the system is so I had cutting a mite this is an incredibly complicated theory that I did points about these kinds of things oh so there's we all know what a Western is ye","cited_quote":"s a Western is where is conceptually a world in which there is no law and order and a man shows up and imposes personally law and order on the territory the community right so there is also a eastern what is in Eastern and Eastern is a place where by contrast is a story where they're like I got this straight it was four types the Eastern is where there is law and order there is so there are institutions of Justice but they are have been subverted by people from within so an Eastern would be the Serpico is an Eastern it's a crooked cop who is it's the bad apple who has you know screwed up there there's lots of tons and tons of of Hollywood movies are Easterns the northern is the case where law and order exists and law notre is morally righteous system works law know that show law and order is a northern it's a functioning apparatus of Justice which reliably and accurately produces the right the correct result in confronting criminality every single day when it's on TV the southern is where the the entirely the southern is all John Grisham novels or Southern's they are where the entire apparatus is corrupt and where the reformer is not an insider but an outsider so in","cited_url":"https:\/\/youtu.be\/Okg2LH6XKzY?t=8772","citing_context_after":"y-All: The New York City CompStat Crime-Tracking System Reply-All did a story in 2018 about how the New York City's CompStat Crime-Tracking System was developed and how the Police Department changed with the introduction and use of the computer system. The result was that police officers are given quotas for the number of summons (tickets) they need to issue, forcing them to trump up the charges if necessary. It's a story that illustrates the perils of broken-glass policing and how policing evolved in New York City and other cities: PEDRO: Some guy jumps out. And this one guy, in front of a bodega, doing absolutely nothing, they gave him a summons for blocking pedestrian traffic. You know, we were just shaking our heads like, \"What did you give him?\" \"Blocking pedestrian traffic.\" And they just start laughing. I'm like, oh wow. All right. So we move on. PJ: Pedro says the next stop was this Mexican man who was just sitting alone on a stoop. They wrote him up for the exact same thing: B","citing_context_before":"nymore? Because people don't spend years studying books. You can mark up the quote with html tags such as , ,  or any other tag that will not change the text version of the quote when the hmtl is converted to text. 3: YouTube Video: Malcolm Gladwell: Crime Show Taxonomy When you cite a YouTube video, in addition to looking up the 500 characters of transcript context, CiteIt's WordPress Plugin embeds a hidden iframe, starting at the video's start time if you include the time offset in your link. ","citing_quote":"a Western is where is conceptually a world in which there is no law and order and a man shows up and imposes personally law and order on the territory the community right so there is also a eastern what is in Eastern and Eastern is a place where by contrast is a story where they're like I got this straight it was four types the Eastern is where there is law and order there is so there are institutions of Justice but they are have been subverted by people from within so an Eastern would be the Serpico is an Eastern it's a crooked cop who is it's the bad apple who has you know screwed up there there's lots of tons and tons of of Hollywood movies are Easterns the northern is the case where law and order exists and law notre is morally righteous system works law know that show law and order is a northern it's a functioning apparatus of Justice which reliably and accurately produces the right the correct result in confronting criminality every single day when it's on TV the southern is where the the entirely the southern is all John Grisham novels or Southern's they are where the entire apparatus is corrupt and where the reformer is not an insider but an outsider 4: Repl","citing_url":"https:\/\/www.openpolitics.com\/citeit-sample-code-master\/examples.html","hashkey":"aWesterniswhereisconceptuallyaworldinwhichthereisnolawandorderandamanshowsupandimposespersonallylawandorderontheterritorythecommunityrightsothereisalsoaeasternwhatisinEasternandEasternisaplacewherebycontrastisastorywheretheyrelikeIgotthisstraightitwasfourtypestheEasterniswherethereislawandorderthereissothereareinstitutionsofJusticebuttheyarehavebeensubvertedbypeoplefromwithinsoanEasternwouldbetheSerpicoisanEasternitsacrookedcopwhoisitsthebadapplewhohasyouknowscreweduptherethereslotsoftonsandtonsofofHollywoodmoviesareEasternsthenorthernisthecasewherelawandorderexistsandlawnotreismorallyrighteoussystemworkslawknowthatshowlawandorderisanorthernitsafunctioningapparatusofJusticewhichreliablyandaccuratelyproducestherightthecorrectresultinconfrontingcriminalityeverysingledaywhenitsonTVthesoutherniswherethetheentirelythesouthernisallJohnGrishamnovelsorSouthernstheyarewheretheentireapparatusiscorruptandwherethereformerisnotaninsiderbutanoutsider|www.openpolitics.com\/citeit-sample-code-master\/examples.html|youtu.be\/Okg2LH6XKzY?t=8772","sha256":"cec423ea5729b8d4190e91d74fcfa6ae823210a260ddcc07b9634344daaad24f"}