{"cited_context_after":" over Vietnam, civil rights and the slayings of two charismatic leaders, Ms. Rodham was completing a sweeping intellectual, political and stylistic shift. She came to Wellesley as an 18-year-old Republican, a copy of Barry Goldwater's right-wing treatise, \"The Conscience of a Conservative,\" on the shelf of her freshman dorm room. She would leave as an antiwar Democrat whose public rebuke of a Republican senator in a graduation speech won her notice in Life magazine as a voice for her generation.Hillary Rodham Clinton's course was set, in large part, during the supercharged year of 1968. \"There was a sense of tremendous change, internationally and here at home which impacted greatly how I thought about things,\" Mrs. Clinton said in a telephone interview about that period, which encompassed the second half of her junior and first half of her senior years.It was a time at once disorienting and clarifying, a period that would reinforce the future senator and presidential candidate's suspic","cited_context_before":"at some campuses went to the barricades, Ms. Rodham was attending teach-ins, leading panel discussions and joining steering committees. She preferred her \"confrontation politics\" cooler. \"She was not an antiwar radical trying to create a mass movement,\" said Ellen DuBois, who, with Ms. Rodham, was an organizer of a student strike that April. \"She was very much committed to working within the political system. From a student activist perspective, there was a significant difference.\"As the nation ","cited_quote":"boiled","cited_url":"https:\/\/www.nytimes.com\/2007\/09\/05\/us\/politics\/05clinton.html","citing_context_after":"\" racist messages #ff3399 Error citeit-error-quote-returned Error in Returned Quote Quote: Clinton asserted President Trump's 2018 budget proposal was \"a con\" for underfunding domestic programsReturned: Clinton called Mr. Trump's 2018 budget proposal \" a cong \" which she said would underfund public education red Error citeit-error-quote-context-edges Slight character errors in Surrounding Context Example: \"adding that her mother Dorothy \"made sure I learned [these] words from our Methodist faith\" Quote: \"And she made sure I learned [these] ds from our Methodist faith\" red PDF citeit-pdf-scanned Source Document is a PDF image that needs to be scanned with OCR Example: memorandum saying \"the data indicates that the President remains healthy.\" HTML: memorandum saying \"the data indicates that the President remains healthy. #0099ff Match citeit-footnote-shortname Footnote is a short form of citation. The program needs to Need to cross-reference the short name with the longer reference in th","citing_context_before":" assume that the first Wikipedia article's citations would be manually marked up with hand-coding or the using the editor, but that eventually, the goal would be to automate the process of converting existing citations to CiteIt's Contextual Citations. Test Cases This list of a few of the issues that could could be converted into a test suite that is used in development. Category Class Description Example Color Error citeit-error-context Context is Returned, but Incorrect Example: convention's \"","citing_quote":"veiled","citing_url":"https:\/\/pages.citeit.net\/2020\/10\/24\/wikipedia-project\/","hashkey":"veiled|pages.citeit.net\/2020\/10\/24\/wikipedia-project|www.nytimes.com\/2007\/09\/05\/us\/politics\/05clinton.html","sha256":"d3bb2acdd9c285d5261dcd438dd258219832dcab94120fbdb80cbe36e0a57237"}